{
  "describe": "Describe column's values (Top unique values, Min, Max, Sum, STD, Var,...)",
  "filter": "Defining custom Filtering for the main spreadsheet, Charts, ...",
  "build": "Creating a/multi new column based on the existing columns or random values",
  "reshape":  "Create a new grid using either PIVOT table, Aggregations w/ GroupBy or Transpose.",
  "corr": "Presenting correlations matrix and chart",
  "charts": "Plot chart (line, bar, scatter, pie, wordcloud,...)",
  "heatmap": "Presenting heatmap for numerical values in the main table. 'Overall' will calculate over the min/max of every column whereas 'By Col' will calculate each column individually by its min/max.",
  "highlight_dtypes": "Highlight columns based on pandas dtypes. For dtype's name hover the mouse over column name.",
  "highlight_missings": "Highlight any cells which contain \"nan\" values (or in the case of strings, empty strings or strings consisting only of spaces). Also, a \"!\" will be prepended to any column header which contains missing values.",
  "highlight_outliers": "Highlight any cells for numeric columns which surpass the upper or lower bounds of a custom outlier computation. Lower bounds outliers will be on a red scale and upper bounds outliers will be on a blue scale. Also, a \"★\" will be prepended to any column header which contains outliers.",
  "highlight_range": "Highlight any cells for numeric columns which match any of the filters for equals, greater than or less than. Click \"Highlight Range\" to update filters.",
  "instances": "Show existing datasets loaded to D-Tale.",
  "code": "Code snippet of commands performed upon your data to produce this grid.",
  "export": "Download DataFrame as CSV or TSV",
  "widths": "Auto-Resize the column widths",
  "about": "Link to the source code repository, documentation",
  "shutdown": "Close D-Tale and all other open datasets without save. Do you want to export DataFrame?",
  "editing": "Update cells to anything you'd like. Press \"Enter\" to confirm or \"Esc\" to exit. Invalid types will throw errors. Protected values are \"nan\" & \"inf\".",
  "xarray_conversion": "Convert your pandas.Dataframe to an xarray.Dataset by selecting columns as an index. Once this is complete you'll be able to view different slices of your data by choosing index values.",
  "upload": "Load CSV/TSV files, CSV/TSV/JSON from the web or sample datasets to D-Tale using pandas.read_csv(), pandas.read_json() or customized loaders.",
  "duplicates": "Remove duplicate columns/values from your data as well as extract duplicates out into separate instances.",
  "theme": "Toggle between light & dark themes for your viewing pleasure (only affects grid, not popups or charts).",
  "pps": "PPS is an asymmetric, data-type-agnostic score that can detect linear or non-linear relationships between two columns. The score ranges from 0 (no predictive power) to 1 (perfect predictive power). It can be used as an alternative to the correlation (matrix). WARNING: This could take a while to load.",
  "network": "If you're currently viewing data containing information for a directed graph then try feeding it into our \"Network Viewer\"",
  "reload_data": "Force a reload of the data from the server for the current rows being viewing in the grid by clicking this button. This can be helpful when viewing the grid from within another application like jupyter or nested within another website.",
  "merge": "Merge & Stack (concatenate vertically) dataframes currently loaded into D-Tale or upload additional ones for taht purpose."
}